[
  {
    "id": "inguinal_hernia",
    "category": "General Surgery",
    "name": "Inguinal Hernia",
    "steps": "<h3>1. Inspection (Patient Standing)</h3><ul><li><strong>Exposure:</strong> Patient must stand. Expose from umbilicus to mid-thigh.</li><li><strong>Observation:</strong> Identify the site (inguinal vs femoral), shape (pyriform vs globular), and extent (scrotal extension). Look for surgical scars.</li><li><strong>Cough Impulse:</strong> Ask patient to turn head away and cough. Observe for an expansile impulse.</li></ul><h3>2. Palpation (Patient Standing)</h3><ul><li><strong>Get Above the swelling:</strong> Palpate the root of the scrotum. If you <em>cannot</em> get above the swelling, it is an inguinoscrotal hernia. If you <em>can</em>, it is a primary scrotal swelling (e.g., hydrocele).</li><li><strong>Palpate the Lump:</strong> Assess consistency (soft/gurgling = bowel; doughy = omentum), tenderness, and temperature.</li><li><strong>Reducibility:</strong> Ask the patient to reduce the hernia themselves. If they cannot, attempt gentle taxis.</li><li><strong>Deep Ring Occlusion Test:</strong> Reduce the hernia. Locate the deep inguinal ring (midpoint of the inguinal ligament: 1.5cm superior to the femoral pulse). Occlude it firmly with your thumb. Ask patient to cough.<ul><li><strong>Controlled (Hernia does not reappear):</strong> Indirect Inguinal Hernia (passes through deep ring).</li><li><strong>Uncontrolled (Hernia reappears medial to thumb):</strong> Direct Inguinal Hernia (bulges through posterior wall/Hesselbach's triangle).</li></ul></li></ul><h3>3. Palpation (Patient Lying)</h3><ul><li><strong>Confirm Reducibility:</strong> If irreducible standing, re-attempt supine.</li><li><strong>Testes:</strong> Palpate both testes to rule out atrophy or masses.</li></ul><h3>4. Auscultation</h3><ul><li><strong>Bowel Sounds:</strong> Presence confirms enterocele (bowel content) vs omentocele.</li></ul>",
    "ddx": "<h3>Differentiating Groin Lumps</h3><div class=\"box box-blue\"><span class=\"box-title\">Types</span><ul><li><strong>Indirect Inguinal Hernia:</strong> Passes through deep ring, travels down inguinal canal, often descends into scrotum. Controlled by deep ring pressure. (Congenital patent processus vaginalis).</li><li><strong>Direct Inguinal Hernia:</strong> Bulges directly through Hesselbach's triangle (posterior wall weakness). Rarely enters scrotum. Not controlled by deep ring pressure. (Acquired weakness).</li><li><strong>Femoral Hernia:</strong> Globular lump below the inguinal ligament and lateral to the pubic tubercle. Neck is inferior to the inguinal ligament. High risk of strangulation due to rigid borders (lacunar ligament).</li><li><strong>Saphena Varix:</strong> Soft, compressible lump at the saphenofemoral junction. Exhibits a thrill on coughing (Cruveilhier's sign) and disappears instantly on lying down.</li></ul></div><h3>Anatomy</h3><strong>Anatomical Boundaries of Inguinal Canal:</strong> <br>- <em>Anterior:</em> External oblique aponeurosis. <br>- <em>Posterior:</em> Transversalis fascia (weak in direct hernia). <br>- <em>Roof:</em> Conjoint tendon (internal oblique + transversus abdominis). <br>- <em>Floor:</em> Inguinal ligament. <br><strong>Hesselbach's Triangle:</strong> Boundaries are Inferior Epigastric vessels (Lateral), Rectus Abdominis border (Medial), and Inguinal Ligament (Inferior).",
    "inv": "<h3>Routine</h3><ul><li>Clinical Diagnosis is usually sufficient.</li></ul><h3>Imaging</h3><ul><li><strong>USG Groin:</strong> If diagnosis is uncertain or to distinguish from hydrocele/lymph node.</li><li><strong>CT Abdomen:</strong> If strangulation or obstruction is suspected.</li></ul>",
    "mgmt": "<h3>Surgical Management</h3><ul><li><strong>Mesh Repair (Lichtenstein):</strong> Standard open tension-free repair.</li><li><strong>Laparoscopic (TEP/TAPP):</strong> Indicated for bilateral or recurrent hernias to avoid scar tissue and for faster recovery.</li><li><strong>Strangulation:</strong> Surgical emergency requiring resection of non-viable bowel.</li></ul>"
  },
  {
    "id": "thyroid_status",
    "category": "Endocrine",
    "name": "Thyroid Status",
    "steps": "<h3>1. Inspection (Anterior)</h3><ul><li><strong>Water Swallow Test:</strong> Give patient a glass of water. Observe the neck as they swallow. A thyroid swelling will move <em>up</em> with the larynx (due to attachment via pretracheal fascia).</li><li><strong>Tongue Protrusion:</strong> If a midline mass moves up on tongue protrusion, it is a Thyroglossal Cyst (attached to foramen cecum).</li><li><strong>General Observation:</strong> Look for scars (Kocher’s incision), dilated veins (retrosternal obstruction), or redness.</li></ul><h3>2. Palpation (From Behind)</h3><ul><li><strong>Thyroid Gland:</strong> Flex the patient's neck slightly to relax sternocleidomastoids. Palpate the isthmus and both lobes. Assess size, surface (smooth/nodular), consistency (soft/firm/hard), and tenderness.</li><li><strong>Fixation:</strong> Ask patient to swallow while palpating to feel if the gland moves freely or is fixed to strap muscles (malignancy/thyroiditis).</li><li><strong>Lymph Nodes:</strong> systematically examine levels I-VI.</li><li><strong>Carotid Arteries:</strong> Check for Berry's Sign (carotid pulse displaced posteriorly by large goiter).</li><li><strong>Trachea:</strong> Check for deviation.</li></ul><h3>3. Percussion & Auscultation</h3><ul><li><strong>Percussion:</strong> Percuss over the manubrium. Dullness suggests retrosternal extension.</li><li><strong>Auscultation:</strong> Listen over the lobes for a systolic bruit (pathognomonic of increased vascularity in Graves' disease).</li></ul><h3>4. Systemic Signs (Thyroid Status)</h3><ul><li><strong>Hands:</strong> Pulse (Tachycardia/AF), Fine tremor (Paper test), Palmar erythema, Thyroid Acropachy (clubbing-like swelling in Graves'), Onycholysis (Plummer's nails).</li><li><strong>Eyes:</strong> Exophthalmos (Proptosis - view from above), Lid Retraction (Dalrymple's sign - see sclera above iris), Lid Lag (Von Graefe's sign - lid slow to follow finger down), Ophthalmoplegia (H-test).</li><li><strong>Legs:</strong> Pretibial Myxedema (waxy non-pitting edema in Graves').</li><li><strong>Reflexes:</strong> Slow relaxing ankle jerks (Hypothyroidism).</li></ul>",
    "ddx": "<h3>Diagnostic Patterns</h3><div class=\"box box-blue\"><span class=\"box-title\">Differentials</span><ul><li><strong>Graves' Disease (Primary Thyrotoxicosis):</strong> Diffuse smooth goiter + Thyroid Bruit + Exophthalmos + Pretibial Myxedema + Tremor.</li><li><strong>Multinodular Goiter (MNG):</strong> Asymmetrical, nodular gland. Usually euthyroid. No bruit or eye signs.</li><li><strong>Thyroid Carcinoma:</strong> Solitary, hard, irregular nodule. Rapid growth. Fixation to surrounding structures. Cervical lymphadenopathy. Hoarseness (Recurrent Laryngeal Nerve palsy).</li><li><strong>Hashimoto's Thyroiditis:</strong> Firm, rubbery, diffuse goiter (bossellated). Often Hypothyroid.</li></ul></div><h3>Retrosternal Goiter</h3>Suspect if the lower border of the thyroid is not palpable or if there is retrosternal dullness. Can cause Pemberton's Sign (facial congestion/stridor upon raising arms due to thoracic inlet obstruction).",
    "inv": "<h3>Labs</h3><ul><li><strong>TFTs:</strong> TSH, T3, T4.</li><li><strong>Antibodies:</strong> Anti-TPO (Hashimoto's), TRAb (Graves').</li><li><strong>Calcitonin:</strong> Medullary Thyroid Ca.</li></ul><h3>Imaging/Pathology</h3><ul><li><strong>USG Neck:</strong> Assess solid vs cystic, calcifications.</li><li><strong>FNAC:</strong> Bethesda Classification.</li></ul>",
    "mgmt": "<h3>Complications of Thyroidectomy</h3><ul><li><strong>Hemorrhage:</strong> Hematoma causing airway compression (Management: Remove sutures/clips immediately at bedside).</li><li><strong>Hypocalcemia:</strong> Damage to parathyroid glands (Chvostek's/Trousseau's signs).</li><li><strong>Recurrent Laryngeal Nerve Palsy:</strong> Unilateral hoarseness; Bilateral airway obstruction.</li><li><strong>Thyroid Storm:</strong> Life-threatening thyrotoxicosis crisis.</li></ul>"
  },
  {
    "id": "varicose_veins",
    "category": "Vascular",
    "name": "Varicose Veins",
    "steps": "<h3>1. Inspection (Patient Standing)</h3><ul><li><strong>Distribution:</strong> Inspect Medial Thigh/Calf (Long Saphenous Vein territory) and Posterior Calf (Short Saphenous Vein territory).</li><li><strong>Skin Changes (CEAP C4):</strong> Look for Venous Eczema, Haemosiderin staining (brown pigmentation from RBC breakdown), Lipodermatosclerosis (inverted champagne bottle leg - fibrosis of fat), Atrophie Blanche (white scars).</li><li><strong>Ulcers (CEAP C6):</strong> Typically in the 'gaiter area' (medial malleolus). Shallow, irregular sloping edges, granulation tissue base.</li></ul><h3>2. Palpation</h3><ul><li><strong>Temperature/Tenderness:</strong> Check for hard, tender cords (Superficial Thrombophlebitis).</li><li><strong>Cough Impulse:</strong> Palpate the Saphenofemoral Junction (SFJ) (2.5cm below and lateral to pubic tubercle). A thrill suggests a Saphena Varix.</li><li><strong>Pit Test:</strong> Run fingers along the vein to detect defects in the deep fascia (sites of perforators).</li></ul><h3>3. Special Tests</h3><ul><li><strong>Tap Test:</strong> Tap the SFJ while feeling the vein distally. A transmitted impulse implies a continuous column of blood (valvular incompetence).</li><li><strong>Trendelenburg Test:</strong> Patient lies supine, leg elevated to empty veins. Occlude SFJ with thumb. Ask patient to stand.<ul><li><em>Veins fill rapidly while occluded:</em> Incompetence of perforators or Short Saphenous Vein (below the block).</li><li><em>Veins fill rapidly only after release:</em> SFJ incompetence.</li></ul></li><li><strong>Perthes Test:</strong> Apply tourniquet below knee. Ask patient to perform heel raises. If veins become empty, deep veins are patent. If veins become turgid/painful, deep veins are occluded (Do not operate!).</li></ul><h3>4. Auscultation</h3><ul><li><strong>Handheld Doppler:</strong> Listen over SFJ. Squeeze calf (augmentation) then release. A 'whoosh' lasting >0.5s on release indicates reflux.</li></ul>",
    "ddx": "<h3>Key Signs & Definitions</h3><div class=\"box box-blue\"><span class=\"box-title\">Definitions</span><ul><li><strong>Varicose Veins:</strong> Dilated, tortuous superficial veins >3mm in diameter.</li><li><strong>Saphena Varix:</strong> A dilation at the SFJ. It is soft, compressible, exhibits a cough impulse, and disappears completely on lying down (unlike a femoral hernia).</li><li><strong>Lipodermatosclerosis:</strong> Chronic venous hypertension causes inflammation and fibrosis of the subcutaneous fat, constricting the lower leg.</li></ul></div>",
    "inv": "<h3>Bedside</h3><ul><li>Handheld Doppler (Biphasic signal).</li><li>ABPI (To rule out arterial disease before compression).</li></ul><h3>Imaging</h3><ul><li><strong>Duplex Ultrasound (Gold Standard):</strong> Maps anatomy and identifies reflux (>0.5s) at SFJ, SPJ, and perforators.</li></ul>",
    "mgmt": "<h3>Indications for Intervention</h3>Bleeding, Symptomatic (pain/heaviness), Recurrent Superficial Thrombophlebitis, Skin changes (C4-C6), Ulceration. <br><h3>Treatment Options</h3><ul><li><strong>Conservative:</strong> Class 2 graduated compression stockings.</li><li><strong>Endothermal Ablation (Gold Standard):</strong> Radiofrequency Ablation (RFA) or Endovenous Laser (EVLT) to burn/seal the vein.</li><li><strong>Ultrasound-Guided Foam Sclerotherapy:</strong> Chemical sclerosis.</li><li><strong>Open Surgery:</strong> High Tie (ligation of SFJ) and Strip (removal of LSV).</li></ul>"
  },
  {
    "id": "pvd_arterial",
    "category": "Vascular",
    "name": "Peripheral Arterial Disease",
    "steps": "<h3>1. Inspection</h3><ul><li><strong>Trophic Changes:</strong> Look for shiny hairless skin, dystrophic (thick/ridged) nails, and muscle wasting (guttering).</li><li><strong>Color:</strong> Pallor (ischemia), Rubor (reactive hyperemia/Buerger's sign), or Cyanosis.</li><li><strong>Ulcers:</strong> Arterial ulcers are typically 'punched out', deep, painful, and located on pressure points (tips of toes, heel, metatarsal heads).</li><li><strong>Gangrene:</strong> Dry (mummified/black) vs Wet (infected/oozing).</li><li><strong>Buerger's Test:</strong> Elevate legs to 45° for 1-2 mins. Observe for pallor (Buerger's angle <20° = severe ischemia). Then hang legs dependent. Observe for 'sunset foot' (reactive hyperemia - deep red/purple).</li></ul><h3>2. Palpation</h3><ul><li><strong>Temperature:</strong> Compare legs using the dorsal aspect of the hand. Ischemic limbs are cool.</li><li><strong>Capillary Refill Time (CRT):</strong> Press on a digit for 5s. Normal return is <2s. Prolonged >2s indicates ischemia.</li><li><strong>Pulses:</strong> Palpate systematically:<ul><li><em>Femoral:</em> Mid-inguinal point.</li><li><em>Popliteal:</em> Deep in popliteal fossa, knee flexed to 30°.</li><li><em>Posterior Tibial:</em> 2cm below and posterior to medial malleolus.</li><li><em>Dorsalis Pedis:</em> Lateral to Extensor Hallucis Longus tendon.</li></ul></li></ul><h3>3. Auscultation</h3><ul><li><strong>Bruits:</strong> Listen over Femoral arteries, Aorta, and Renal arteries for turbulent flow.</li></ul>",
    "ddx": "<h3>Clinical Features</h3><div class=\"box box-blue\"><span class=\"box-title\">Definitions</span><ul><li><strong>Intermittent Claudication:</strong> Cramping muscle pain (usually calf) on walking a fixed distance, relieved by rest within minutes. Reproducible.</li><li><strong>Critical Limb Ischemia:</strong> Rest pain (burning pain at night, relieved by hanging leg out of bed) OR Tissue loss (Ulcer/Gangrene) present for >2 weeks.</li><li><strong>Leriche Syndrome:</strong> Aortoiliac occlusion triad: 1. Buttock claudication, 2. Absent femoral pulses, 3. Erectile dysfunction.</li></ul></div>",
    "inv": "<h3>Ankle Brachial Pressure Index (ABPI)</h3>Ratio of ankle systolic pressure to brachial systolic pressure. <br>- <em>>0.9:</em> Normal. <br>- <em>0.5 - 0.9:</em> Claudication. <br>- <em><0.5:</em> Critical Limb Ischemia. <br>- <em>>1.3:</em> Calcified/Non-compressible vessels (Diabetes/CKD - falsely high). <br><h3>Imaging</h3><ul><li>Duplex Ultrasound.</li><li>CT Angiogram.</li></ul>",
    "mgmt": "<h3>Best Medical Therapy</h3><ul><li>Antiplatelet (Clopidogrel).</li><li>Statin (Atorvastatin 80mg).</li><li>BP control.</li><li>Smoking cessation.</li><li>Supervised Exercise program.</li></ul><h3>Intervention</h3><ul><li><strong>Angioplasty:</strong> Balloon/Stenting.</li><li><strong>Bypass grafting:</strong> e.g., Fem-Pop bypass (Vein graft preferred).</li><li><strong>Amputation:</strong> If unsalvageable.</li></ul>"
  },
  {
    "id": "abdominal_mass",
    "category": "Abdominal",
    "name": "Abdominal Mass",
    "steps": "<h3>1. Inspection</h3><ul><li><strong>Distension:</strong> Check for the 5 F's (Fat, Fluid, Fetus, Flatus, Feces).</li><li><strong>Visible Mass:</strong> Look for a mass moving with respiration or visible pulsation (AAA).</li><li><strong>Scars:</strong> Identify previous surgical incisions (e.g., Kocher's, Midline, Rooftop).</li></ul><h3>2. Palpation</h3><ul><li><strong>Superficial & Deep:</strong> Palpate all 9 quadrants. Define the mass: Site, Size, Shape, Surface (smooth/nodular), Edge (regular/irregular), Consistency (soft/hard), Tenderness, Pulsatility.</li><li><strong>Organomegaly - Liver:</strong> Start RIF, move up to costal margin. Feel for edge. Assess span (scratch test/percussion).</li><li><strong>Organomegaly - Spleen:</strong> Start RIF, move diagonally towards LUQ. A spleen moves inferomedially with inspiration.</li><li><strong>Organomegaly - Kidney:</strong> Bimanual palpation (balloting). Place one hand behind loin and one anteriorly.</li></ul><h3>3. Percussion</h3><ul><li><strong>Note:</strong> Percuss over the mass. Dullness indicates solid organ/fluid. Resonance indicates gas-filled bowel.</li><li><strong>Shifting Dullness:</strong> Test for ascites (percuss from center to flank, patient rolls to side).</li></ul><h3>4. Auscultation</h3><ul><li><strong>Bowel Sounds:</strong> Obstruction (tinkling) vs Ileus (absent).</li><li><strong>Bruits:</strong> Renal artery (epigastric) or Hepatic (over liver - HCC).</li></ul>",
    "ddx": "<h3>Differentiating Masses</h3><div class=\"box box-blue\"><span class=\"box-title\">Organomegaly Characteristics</span><ul><li><strong>Splenomegaly:</strong> Moves inferomedially with inspiration, has a palpable notch on anterior edge, unable to get above it, dull to percussion.</li><li><strong>Enlarged Kidney:</strong> Moves inferiorly with inspiration, ballotable between hands, resonant to percussion (band of colonic resonance over anterior surface), can get above it.</li><li><strong>Hepatomegaly:</strong> Moves inferiorly, cannot get above it, dull to percussion.</li></ul></div><h3>Etiology</h3><strong>Causes of Hepatomegaly:</strong> <br>- <em>Smooth:</em> Heart failure, Hepatitis, Fatty Liver. <br>- <em>Craggy/Irregular:</em> Metastases, Hepatocellular Carcinoma (HCC), Cirrhosis. <br><strong>Causes of Splenomegaly:</strong> Massive (>10cm): Malaria, CML, Myelofibrosis. Moderate: Portal hypertension, Lymphoma, Hemolysis.",
    "inv": "<h3>Routine</h3><ul><li>Urine Dip.</li><li>Blood: FBC, U/E, LFT, Coagulation.</li></ul><h3>Imaging</h3><ul><li><strong>USG Abdomen:</strong> First line for organomegaly.</li><li><strong>CT Abdomen/Pelvis:</strong> For characterization and staging.</li></ul>",
    "mgmt": "<h3>Management Principles</h3><ul><li>Dependent on underlying cause.</li><li><strong>Malignancy:</strong> Staging and Resection/Chemotherapy.</li><li><strong>AAA:</strong> EVAR or Open Repair if >5.5cm.</li></ul>"
  },
  {
    "id": "stoma",
    "category": "Abdominal",
    "name": "Stoma Examination",
    "steps": "<h3>1. Inspection</h3><ul><li><strong>Site:</strong> Right Iliac Fossa (Ileostomy/Urostomy) vs Left Iliac Fossa (Colostomy).</li><li><strong>Spout vs Flush:</strong> <br>- <em>Spouted:</em> Ileostomy (to protect skin from enzymes) or Urostomy. <br>- <em>Flush:</em> Colostomy (solid stool less irritant).</li><li><strong>Lumen:</strong> <br>- <em>One opening:</em> End stoma (permanent or Hartmann's). <br>- <em>Two openings (connected):</em> Loop stoma (temporary/defunctioning). <br>- <em>Two openings (separated):</em> Double barrel.</li><li><strong>Effluent:</strong> Liquid/Green (Ileostomy), Solid/Brown (Colostomy), Urine (Urostomy).</li><li><strong>Surrounding Skin:</strong> Erythema, Excoriation, Herniation (bulge), Prolapse (telescoping bowel), Retraction.</li></ul><h3>2. Palpation</h3><ul><li><strong>Stoma:</strong> Gently palpate the opening (digital exam) to check patency and assess for stenosis (if appropriate).</li><li><strong>Cough Impulse:</strong> Check for Parastomal Hernia (defect in rectus muscle).</li><li><strong>Skin:</strong> Tenderness or induration.</li></ul><h3>3. Conclusion</h3><ul><li>\"I would like to examine the rectum (to check for stump/tumor) and review the fluid balance chart (high output).\".</li></ul>",
    "ddx": "<h3>Stoma Types</h3><div class=\"box box-blue\"><span class=\"box-title\">Definitions</span><ul><li><strong>End Colostomy:</strong> LIF, Flush. Formed after Abdominoperineal Resection (APR) or Hartmann's procedure.</li><li><strong>Loop Ileostomy:</strong> RIF, Spouted. Used to defunction a distal anastomosis (e.g., in Anterior Resection).</li><li><strong>Urostomy (Ileal Conduit):</strong> RIF, Spouted. Continuous urine output. Formed after Radical Cystectomy.</li></ul></div>",
    "inv": "<h3>Investigating Complications</h3><ul><li><strong>Contrast Studies (Gastrografin):</strong> To check for obstruction, fistula, or leaks.</li><li><strong>CT Abdomen:</strong> For parastomal hernia or recurrence of disease.</li><li><strong>Endoscopy:</strong> Via stoma to check proximal bowel.</li></ul>",
    "mgmt": "<h3>Complications</h3><br>- <em>Early:</em> Necrosis (ischemia - black stoma), Retraction (tension), High Output (>1.5L/day -> dehydration/electrolyte loss). <br>- <em>Late:</em> Parastomal Hernia, Prolapse, Stenosis, Skin dermatitis. <br><h3>Management of High Output Stoma</h3>Restrict hypotonic fluids (water/tea), oral rehydration salts (St Mark's solution), Loperamide, Codeine, PPI."
  },
  {
    "id": "breast_lump",
    "category": "General Surgery",
    "name": "Breast Lump",
    "steps": "<h3>1. Inspection (Position 1: Arms by side)</h3><ul><li><strong>Symmetry:</strong> Compare size, shape, and nipple level of both breasts.</li><li><strong>Skin Changes:</strong> Look for Peau d'orange (edema), Dimpling, Puckering, Erythema, or Ulceration.</li><li><strong>Nipple:</strong> Inversion, Discharge (blood/serous), Eczema (Paget's disease), Destruction/Deviation.</li></ul><h3>2. Inspection (Dynamic)</h3><ul><li><strong>Arms above head:</strong> Lifts breasts to expose tethering to the pectoral fascia (cancer will hold skin back).</li><li><strong>Hands on hips (press in):</strong> Contracts Pectoralis Major. Accentuates dimpling if the lump is fixed to the muscle.</li><li><strong>Lean forward:</strong> For large pendulous breasts to expose the underside.</li></ul><h3>3. Palpation (Patient 45° or Flat)</h3><ul><li><strong>Normal Breast:</strong> Use the flat of the hand in a spiral motion. Examine all 4 quadrants + Axillary tail.</li><li><strong>The Lump:</strong> Assess the 3 D's: <em>Dimensions</em>, <em>Depth</em>, <em>Definition</em>. Assess Consistency (Hard/Soft) and Fixation (to skin or muscle).</li><li><strong>Nipple:</strong> Squeeze gently to check for discharge.</li></ul><h3>4. Lymph Nodes (Patient Sitting)</h3><ul><li><strong>Axillary:</strong> Support the patient's arm to relax the axilla. Palpate: Central, Lateral (humerus), Pectoral (anterior), Subscapular (posterior), and Apical nodes.</li><li><strong>Supraclavicular:</strong> Palpate the fossa.</li></ul>",
    "ddx": "<h3>Differential Diagnosis</h3><div class=\"box box-blue\"><span class=\"box-title\">Common Lumps</span><ul><li><strong>Fibroadenoma:</strong> 'Breast Mouse'. Firm, smooth, highly mobile, painless. Common in women <30y.</li><li><strong>Breast Cyst:</strong> Smooth, fluid-filled, fluctuant (unless tense), tender. Common in perimenopausal women (35-50y).</li><li><strong>Carcinoma:</strong> Hard, irregular, distinct edge, tethered to skin/muscle/nipple. Associated with bloody discharge and lymphadenopathy.</li><li><strong>Fibrocystic Change:</strong> Generalized lumpiness, painful, varies with menstrual cycle.</li></ul></div><h3>Definitions</h3><strong>Peau d'orange:</strong> Cutaneous edema caused by blockage of subdermal lymphatics by cancer cells. The skin is swollen but hair follicles remain tethered, mimicking orange peel.",
    "inv": "<h3>Triple Assessment (Gold Standard)</h3><ol><li><strong>Clinical Examination.</strong></li><li><strong>Imaging:</strong> Mammogram (if >35y, as breast is less dense) OR Ultrasound (if <35y). MRI for screening high risk.</li><li><strong>Pathology:</strong> Core Biopsy (Histology - preferred for receptor status) OR FNAC (Cytology).</li></ol>",
    "mgmt": "<h3>Surgical</h3><ul><li><strong>WLE (Wide Local Excision):</strong> Breast conserving + Radiotherapy.</li><li><strong>Mastectomy:</strong> If large tumor/multifocal.</li><li><strong>Axilla:</strong> Sentinel Node Biopsy (standard) -> Axillary Clearance if positive.</li></ul><h3>Adjuvant</h3><ul><li>Chemo, Radiotherapy, Endocrine (Tamoxifen/Letrozole), Herceptin.</li></ul>"
  },
  {
    "id": "lump_bump",
    "category": "General Surgery",
    "name": "Subcutaneous Lump",
    "steps": "<h3>1. Inspection</h3><ul><li><strong>Site & Number:</strong> Single vs Multiple (Lipomatosis/Neurofibromatosis). Anatomical layer (Skin/Subcutaneous).</li><li><strong>Skin Changes:</strong> Look for a Punctum (central black dot - Sebaceous Cyst), Scars, Erythema, or Pigmentation.</li></ul><h3>2. Palpation</h3><ul><li><strong>Temperature & Tenderness:</strong> Inflammation/Abscess.</li><li><strong>Surface & Edge:</strong> Smooth/Lobulated (Lipoma) vs Well-defined/Spherical (Cyst).</li><li><strong>Consistency:</strong> Soft (Lipoma), Firm/Tense (Cyst), Hard (Calcified/Cancer).</li><li><strong>Mobility (Plane):</strong> <br>- <em>Skin Fixation:</em> Pinch skin over lump. If skin moves independently = Subcutaneous (Lipoma). If skin is tethered = Intradermal (Sebaceous Cyst). <br>- <em>Deep Fixation:</em> Tense underlying muscle. If lump becomes fixed = Intramuscular/Bone. If mobile = Subcutaneous.</li><li><strong>Slip Sign:</strong> Press edge of lump. If it slips away under the finger = Lipoma.</li><li><strong>Fluctuation:</strong> Place two fingers on sides, press center. Fluid transmits pressure (Cyst/Abscess).</li></ul><h3>3. Special Tests</h3><ul><li><strong>Transillumination:</strong> Shine torch. Light glows through fluid (Hydrocele, Ganglion, Epididymal Cyst). Lipomas typically do <em>not</em> transilluminate.</li><li><strong>Compressibility:</strong> Disappears on pressure (Hemangioma/Varix).</li></ul>",
    "ddx": "<h3>Common Lumps</h3><div class=\"box box-blue\"><span class=\"box-title\">Differentials</span><ul><li><strong>Lipoma:</strong> Benign tumor of fat. Soft, lobulated, subcutaneous (skin slides over it), positive slip sign. Occurs anywhere with fat.</li><li><strong>Sebaceous (Epidermoid) Cyst:</strong> Distension of sebaceous gland. Firm, round, fixed to skin (cannot pinch skin over it), often has a central punctum. Contains foul cheesy keratin.</li><li><strong>Ganglion:</strong> Cystic degeneration of synovial sheath. Dorsum of wrist/hand. Transilluminates.</li><li><strong>Dermoid Cyst:</strong> Congenital. Midline (brow/nose). Deep to skin.</li></ul></div><h3>Transillumination</h3>Positive in Hydrocele, Epididymal cyst, Cystic Hygroma, Ganglion.",
    "inv": "<h3>Imaging</h3><ul><li><strong>Ultrasound:</strong> Distinguishes solid (lipoma) from cystic (ganglion) and assesses depth/vascularity.</li><li><strong>MRI:</strong> For deep soft tissue sarcomas.</li></ul><h3>Pathology</h3><ul><li><strong>FNAC:</strong> For cytology.</li><li><strong>Excision Biopsy:</strong> Definitive diagnosis.</li></ul>",
    "mgmt": "<h3>Differentiation & Management</h3><strong>Differentiation:</strong> A sebaceous cyst is fixed to the skin (punctum) while a lipoma is mobile under the skin (slip sign). <br><strong>Management:</strong> <br>- <em>Lipoma:</em> Conservative or Excision for cosmesis/pain. <br>- <em>Sebaceous Cyst:</em> Excision biopsy (elliptical incision) to remove the <em>entire capsule</em>. Rupture leads to recurrence and infection."
  }
]
